spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_invalid_card/does_not_make_a_successful_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=6&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_AaIL16BJY28ihTnOkHj2XvxN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Toms-MacBook-Air-2.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44
        PDT 2014; root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64","hostname":"Toms-MacBook-Air-2.local"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 17 Aug 2015 12:13:33 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '779'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6oPJ827VsI6FU3
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16amUbKvv4sqfP0NhXZBD23D",
          "livemode": false,
          "created": 1439813613,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16amUbKvv4sqfP0NEW4OHwJp",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 6,
            "exp_year": 2018,
            "fingerprint": "E7kF800Rn7Ck1iVU",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "1.125.48.213"
        }
    http_version: 
  recorded_at: Mon, 17 Aug 2015 12:13:56 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=400&currency=usd&card=tok_16amUbKvv4sqfP0NhXZBD23D
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_AaIL16BJY28ihTnOkHj2XvxN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Toms-MacBook-Air-2.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44
        PDT 2014; root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64","hostname":"Toms-MacBook-Air-2.local"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Mon, 17 Aug 2015 12:13:35 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6oPJeYsDfTcPS6
      Stripe-Version:
      - '2015-06-15'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_16amUdKvv4sqfP0N2stEzDkK"
          }
        }
    http_version: 
  recorded_at: Mon, 17 Aug 2015 12:13:58 GMT
recorded_with: VCR 2.9.3
