spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/with_valid_card/creates_a_customer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=6&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_AaIL16BJY28ihTnOkHj2XvxN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Toms-MacBook-Air-2.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44
        PDT 2014; root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64","hostname":"Toms-MacBook-Air-2.local"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 27 Aug 2015 09:14:40 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6s6gyNtbyG3vxr
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16eMSyKvv4sqfP0NTqPruwg8",
          "livemode": false,
          "created": 1440666880,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16eMSyKvv4sqfP0NWjXvF3CA",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 6,
            "exp_year": 2018,
            "fingerprint": "WUS6lmDVZLbIK3fX",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "101.169.85.58"
        }
    http_version: 
  recorded_at: Thu, 27 Aug 2015 09:14:58 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: email=lilyan%40kemmer.net&plan=base&card=tok_16eMSyKvv4sqfP0NTqPruwg8
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_AaIL16BJY28ihTnOkHj2XvxN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Toms-MacBook-Air-2.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44
        PDT 2014; root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64","hostname":"Toms-MacBook-Air-2.local"}'
      Content-Length:
      - '69'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 27 Aug 2015 09:14:42 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2367'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6s6gtsjLLQktLn
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1440666881,
          "id": "cus_6s6gHxhXqUMNt5",
          "livemode": false,
          "description": null,
          "email": "lilyan@kemmer.net",
          "shipping": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_6s6gHxhXqUMNt5/subscriptions",
            "data": [
              {
                "id": "sub_6s6gKbhPT5q1fE",
                "plan": {
                  "interval": "month",
                  "name": "base",
                  "created": 1440665409,
                  "amount": 999,
                  "currency": "usd",
                  "id": "base",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_descriptor": "MyFlix Int. Billing"
                },
                "object": "subscription",
                "start": 1440666881,
                "status": "active",
                "customer": "cus_6s6gHxhXqUMNt5",
                "cancel_at_period_end": false,
                "current_period_start": 1440666881,
                "current_period_end": 1443345281,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "tax_percent": null,
                "metadata": {}
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "sources": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_6s6gHxhXqUMNt5/sources",
            "data": [
              {
                "id": "card_16eMSyKvv4sqfP0NWjXvF3CA",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 6,
                "exp_year": 2018,
                "fingerprint": "WUS6lmDVZLbIK3fX",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "tokenization_method": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6s6gHxhXqUMNt5"
              }
            ]
          },
          "default_source": "card_16eMSyKvv4sqfP0NWjXvF3CA"
        }
    http_version: 
  recorded_at: Thu, 27 Aug 2015 09:15:00 GMT
recorded_with: VCR 2.9.3
